// Decompiled with JetBrains decompiler
// Type: GotDotNet.XPointer.LexUtils
// Assembly: XInclude, Version=1.0.5338.18190, Culture=neutral, PublicKeyToken=b0a92c4c738ff598
// MVID: A508C8EB-5BD8-4635-B171-E7AA907C25ED
// Assembly location: R:\Programming\XInclude Decompile\XInclude.dll

#nullable disable
namespace GotDotNet.XPointer
{
	internal class LexUtils
	{
		private const int FSTARTNAME = 1;
		private const int FNAME = 2;
		private const string _NameChars = "-.0:AZ__az··ÀÖØöøıĴľŁňŊžƀǃǍǰǴǵǺȗɐʨʻˁːˑ̀͠͡ͅΆΊΌΌΎΡΣώϐϖϚϚϜϜϞϞϠϠϢϳЁЌЎяёќўҁ҃҆ҐӄӇӈӋӌӐӫӮӵӸӹԱՖՙՙաֆֹֻֽֿֿׁׂ֑֣֡ׄׄאתװײءغـْ٠٩ٰڷںھۀێېۓە۪ۭۨ۰۹ँःअह़्॑॔क़ॣ०९ঁঃঅঌএঐওনপরললশহ়়াৄেৈো্ৗৗড়ঢ়য়ৣ০ৱਂਂਅਊਏਐਓਨਪਰਲਲ਼ਵਸ਼ਸਹ਼਼ਾੂੇੈੋ੍ਖ਼ੜਫ਼ਫ਼੦ੴઁઃઅઋઍઍએઑઓનપરલળવહ઼ૅેૉો્ૠૠ૦૯ଁଃଅଌଏଐଓନପରଲଳଶହ଼ୃେୈୋ୍ୖୗଡ଼ଢ଼ୟୡ୦୯ஂஃஅஊஎஐஒகஙசஜஜஞடணதநபமவஷஹாூெைொ்ௗௗ௧௯ఁఃఅఌఎఐఒనపళవహాౄెైొ్ౕౖౠౡ౦౯ಂಃಅಌಎಐಒನಪಳವಹಾೄೆೈೊ್ೕೖೞೞೠೡ೦೯ംഃഅഌഎഐഒനപഹാൃെൈൊ്ൗൗൠൡ൦൯กฮะฺเ๎๐๙ກຂຄຄງຈຊຊຍຍດທນຟມຣລລວວສຫອຮະູົຽເໄໆໆ່ໍ໐໙༘༙༠༩༹༹༵༵༷༷༾ཇཉཀྵ྄ཱ྆ྋྐྕྗྗྙྭྱྷྐྵྐྵႠჅაჶᄀᄀᄂᄃᄅᄇᄉᄉᄋᄌᄎᄒᄼᄼᄾᄾᅀᅀᅌᅌᅎᅎᅐᅐᅔᅕᅙᅙᅟᅡᅣᅣᅥᅥᅧᅧᅩᅩᅭᅮᅲᅳᅵᅵᆞᆞᆨᆨᆫᆫᆮᆯᆷᆸᆺᆺᆼᇂᇫᇫᇰᇰᇹᇹḀẛẠỹἀἕἘἝἠὅὈὍὐὗὙὙὛὛὝὝὟώᾀᾴᾶᾼιιῂῄῆῌῐΐῖΊῠῬῲῴῶῼ⃐⃜⃡⃡ΩΩKÅ℮℮ↀↂ々々〇〇〡〯〱〵ぁゔ゙゚ゝゞァヺーヾㄅㄬ一龥가힣";
		private static string _NameChars2 = bytearray {2D 00 2E 00 30 00 3A 00 41 00 5A 00 5F 00 5F 00   // -...0.:.A.Z._._.
															 61 00 7A 00 B7 00 B7 00 C0 00 D6 00 D8 00 F6 00   // a.z.............
															 F8 00 31 01 34 01 3E 01 41 01 48 01 4A 01 7E 01   // ..1.4.>.A.H.J.~.
															 80 01 C3 01 CD 01 F0 01 F4 01 F5 01 FA 01 17 02
															 50 02 A8 02 BB 02 C1 02 D0 02 D1 02 00 03 45 03   // P.............E.
															 60 03 61 03 86 03 8A 03 8C 03 8C 03 8E 03 A1 03   // `.a.............
															 A3 03 CE 03 D0 03 D6 03 DA 03 DA 03 DC 03 DC 03
															 DE 03 DE 03 E0 03 E0 03 E2 03 F3 03 01 04 0C 04
															 0E 04 4F 04 51 04 5C 04 5E 04 81 04 83 04 86 04   // ..O.Q.\.^.......
															 90 04 C4 04 C7 04 C8 04 CB 04 CC 04 D0 04 EB 04
															 EE 04 F5 04 F8 04 F9 04 31 05 56 05 59 05 59 05   // ........1.V.Y.Y.
															 61 05 86 05 91 05 A1 05 A3 05 B9 05 BB 05 BD 05   // a...............
															 BF 05 BF 05 C1 05 C2 05 C4 05 C4 05 D0 05 EA 05
															 F0 05 F2 05 21 06 3A 06 40 06 52 06 60 06 69 06   // ....!.:.@.R.`.i.
															 70 06 B7 06 BA 06 BE 06 C0 06 CE 06 D0 06 D3 06   // p...............
															 D5 06 E8 06 EA 06 ED 06 F0 06 F9 06 01 09 03 09
															 05 09 39 09 3C 09 4D 09 51 09 54 09 58 09 63 09   // ..9.<.M.Q.T.X.c.
															 66 09 6F 09 81 09 83 09 85 09 8C 09 8F 09 90 09   // f.o.............
															 93 09 A8 09 AA 09 B0 09 B2 09 B2 09 B6 09 B9 09
															 BC 09 BC 09 BE 09 C4 09 C7 09 C8 09 CB 09 CD 09
															 D7 09 D7 09 DC 09 DD 09 DF 09 E3 09 E6 09 F1 09
															 02 0A 02 0A 05 0A 0A 0A 0F 0A 10 0A 13 0A 28 0A   // ..............(.
															 2A 0A 30 0A 32 0A 33 0A 35 0A 36 0A 38 0A 39 0A   // *.0.2.3.5.6.8.9.
															 3C 0A 3C 0A 3E 0A 42 0A 47 0A 48 0A 4B 0A 4D 0A   // <.<.>.B.G.H.K.M.
															 59 0A 5C 0A 5E 0A 5E 0A 66 0A 74 0A 81 0A 83 0A   // Y.\.^.^.f.t.....
															 85 0A 8B 0A 8D 0A 8D 0A 8F 0A 91 0A 93 0A A8 0A
															 AA 0A B0 0A B2 0A B3 0A B5 0A B9 0A BC 0A C5 0A
															 C7 0A C9 0A CB 0A CD 0A E0 0A E0 0A E6 0A EF 0A
															 01 0B 03 0B 05 0B 0C 0B 0F 0B 10 0B 13 0B 28 0B   // ..............(.
															 2A 0B 30 0B 32 0B 33 0B 36 0B 39 0B 3C 0B 43 0B   // *.0.2.3.6.9.<.C.
															 47 0B 48 0B 4B 0B 4D 0B 56 0B 57 0B 5C 0B 5D 0B   // G.H.K.M.V.W.\.].
															 5F 0B 61 0B 66 0B 6F 0B 82 0B 83 0B 85 0B 8A 0B   // _.a.f.o.........
															 8E 0B 90 0B 92 0B 95 0B 99 0B 9A 0B 9C 0B 9C 0B
															 9E 0B 9F 0B A3 0B A4 0B A8 0B AA 0B AE 0B B5 0B
															 B7 0B B9 0B BE 0B C2 0B C6 0B C8 0B CA 0B CD 0B
															 D7 0B D7 0B E7 0B EF 0B 01 0C 03 0C 05 0C 0C 0C
															 0E 0C 10 0C 12 0C 28 0C 2A 0C 33 0C 35 0C 39 0C   // ......(.*.3.5.9.
															 3E 0C 44 0C 46 0C 48 0C 4A 0C 4D 0C 55 0C 56 0C   // >.D.F.H.J.M.U.V.
															 60 0C 61 0C 66 0C 6F 0C 82 0C 83 0C 85 0C 8C 0C   // `.a.f.o.........
															 8E 0C 90 0C 92 0C A8 0C AA 0C B3 0C B5 0C B9 0C
															 BE 0C C4 0C C6 0C C8 0C CA 0C CD 0C D5 0C D6 0C
															 DE 0C DE 0C E0 0C E1 0C E6 0C EF 0C 02 0D 03 0D
															 05 0D 0C 0D 0E 0D 10 0D 12 0D 28 0D 2A 0D 39 0D   // ..........(.*.9.
															 3E 0D 43 0D 46 0D 48 0D 4A 0D 4D 0D 57 0D 57 0D   // >.C.F.H.J.M.W.W.
															 60 0D 61 0D 66 0D 6F 0D 01 0E 2E 0E 30 0E 3A 0E   // `.a.f.o.....0.:.
															 40 0E 4E 0E 50 0E 59 0E 81 0E 82 0E 84 0E 84 0E   // @.N.P.Y.........
															 87 0E 88 0E 8A 0E 8A 0E 8D 0E 8D 0E 94 0E 97 0E
															 99 0E 9F 0E A1 0E A3 0E A5 0E A5 0E A7 0E A7 0E
															 AA 0E AB 0E AD 0E AE 0E B0 0E B9 0E BB 0E BD 0E
															 C0 0E C4 0E C6 0E C6 0E C8 0E CD 0E D0 0E D9 0E
															 18 0F 19 0F 20 0F 29 0F 35 0F 35 0F 37 0F 37 0F   // .... .).5.5.7.7.
															 39 0F 39 0F 3E 0F 47 0F 49 0F 69 0F 71 0F 84 0F   // 9.9.>.G.I.i.q...
															 86 0F 8B 0F 90 0F 95 0F 97 0F 97 0F 99 0F AD 0F
															 B1 0F B7 0F B9 0F B9 0F A0 10 C5 10 D0 10 F6 10
															 00 11 00 11 02 11 03 11 05 11 07 11 09 11 09 11
															 0B 11 0C 11 0E 11 12 11 3C 11 3C 11 3E 11 3E 11   // ........<.<.>.>.
															 40 11 40 11 4C 11 4C 11 4E 11 4E 11 50 11 50 11   // @.@.L.L.N.N.P.P.
															 54 11 55 11 59 11 59 11 5F 11 61 11 63 11 63 11   // T.U.Y.Y._.a.c.c.
															 65 11 65 11 67 11 67 11 69 11 69 11 6D 11 6E 11   // e.e.g.g.i.i.m.n.
															 72 11 73 11 75 11 75 11 9E 11 9E 11 A8 11 A8 11   // r.s.u.u.........
															 AB 11 AB 11 AE 11 AF 11 B7 11 B8 11 BA 11 BA 11
															 BC 11 C2 11 EB 11 EB 11 F0 11 F0 11 F9 11 F9 11
															 00 1E 9B 1E A0 1E F9 1E 00 1F 15 1F 18 1F 1D 1F
															 20 1F 45 1F 48 1F 4D 1F 50 1F 57 1F 59 1F 59 1F   //  .E.H.M.P.W.Y.Y.
															 5B 1F 5B 1F 5D 1F 5D 1F 5F 1F 7D 1F 80 1F B4 1F   // [.[.].]._.}.....
															 B6 1F BC 1F BE 1F BE 1F C2 1F C4 1F C6 1F CC 1F
															 D0 1F D3 1F D6 1F DB 1F E0 1F EC 1F F2 1F F4 1F
															 F6 1F FC 1F D0 20 DC 20 E1 20 E1 20 26 21 26 21   // ..... . . . &!&!
															 2A 21 2B 21 2E 21 2E 21 80 21 82 21 05 30 05 30   // *!+!.!.!.!.!.0.0
															 07 30 07 30 21 30 2F 30 31 30 35 30 41 30 94 30   // .0.0!0/01050A0.0
															 99 30 9A 30 9D 30 9E 30 A1 30 FA 30 FC 30 FE 30   // .0.0.0.0.0.0.0.0
															 05 31 2C 31 00 4E A5 9F 00 AC A3 D7 }             // .1,1.N......

		private const string _NameStartChars = "::AZ__azÀÖØöøıĴľŁňŊžƀǃǍǰǴǵǺȗɐʨʻˁΆΆΈΊΌΌΎΡΣώϐϖϚϚϜϜϞϞϠϠϢϳЁЌЎяёќўҁҐӄӇӈӋӌӐӫӮӵӸӹԱՖՙՙաֆאתװײءغفيٱڷںھۀێېۓەەۥۦअहऽऽक़ॡঅঌএঐওনপরললশহড়ঢ়য়ৡৰৱਅਊਏਐਓਨਪਰਲਲ਼ਵਸ਼ਸਹਖ਼ੜਫ਼ਫ਼ੲੴઅઋઍઍએઑઓનપરલળવહઽઽૠૠଅଌଏଐଓନପରଲଳଶହଽଽଡ଼ଢ଼ୟୡஅஊஎஐஒகஙசஜஜஞடணதநபமவஷஹఅఌఎఐఒనపళవహౠౡಅಌಎಐಒನಪಳವಹೞೞೠೡഅഌഎഐഒനപഹൠൡกฮะะาำเๅກຂຄຄງຈຊຊຍຍດທນຟມຣລລວວສຫອຮະະາຳຽຽເໄཀཇཉཀྵႠჅაჶᄀᄀᄂᄃᄅᄇᄉᄉᄋᄌᄎᄒᄼᄼᄾᄾᅀᅀᅌᅌᅎᅎᅐᅐᅔᅕᅙᅙᅟᅡᅣᅣᅥᅥᅧᅧᅩᅩᅭᅮᅲᅳᅵᅵᆞᆞᆨᆨᆫᆫᆮᆯᆷᆸᆺᆺᆼᇂᇫᇫᇰᇰᇹᇹḀẛẠỹἀἕἘἝἠὅὈὍὐὗὙὙὛὛὝὝὟώᾀᾴᾶᾼιιῂῄῆῌῐΐῖΊῠῬῲῴῶῼΩΩKÅ℮℮ↀↂ〇〇〡〩ぁゔァヺㄅㄬ一龥가힣";
    
	private static byte[] _chars = new byte[65536];

    public static bool IsWhitespace(char ch) => ch <= ' ' && (4294981120L >> (int) ch & 1L) != 0L;

    static LexUtils()
    {
      LexUtils.SetChars("::AZ__azÀÖØöøıĴľŁňŊžƀǃǍǰǴǵǺȗɐʨʻˁΆΆΈΊΌΌΎΡΣώϐϖϚϚϜϜϞϞϠϠϢϳЁЌЎяёќўҁҐӄӇӈӋӌӐӫӮӵӸӹԱՖՙՙաֆאתװײءغفيٱڷںھۀێېۓەەۥۦअहऽऽक़ॡঅঌএঐওনপরললশহড়ঢ়য়ৡৰৱਅਊਏਐਓਨਪਰਲਲ਼ਵਸ਼ਸਹਖ਼ੜਫ਼ਫ਼ੲੴઅઋઍઍએઑઓનપરલળવહઽઽૠૠଅଌଏଐଓନପରଲଳଶହଽଽଡ଼ଢ଼ୟୡஅஊஎஐஒகஙசஜஜஞடணதநபமவஷஹఅఌఎఐఒనపళవహౠౡಅಌಎಐಒನಪಳವಹೞೞೠೡഅഌഎഐഒനപഹൠൡกฮะะาำเๅກຂຄຄງຈຊຊຍຍດທນຟມຣລລວວສຫອຮະະາຳຽຽເໄཀཇཉཀྵႠჅაჶᄀᄀᄂᄃᄅᄇᄉᄉᄋᄌᄎᄒᄼᄼᄾᄾᅀᅀᅌᅌᅎᅎᅐᅐᅔᅕᅙᅙᅟᅡᅣᅣᅥᅥᅧᅧᅩᅩᅭᅮᅲᅳᅵᅵᆞᆞᆨᆨᆫᆫᆮᆯᆷᆸᆺᆺᆼᇂᇫᇫᇰᇰᇹᇹḀẛẠỹἀἕἘἝἠὅὈὍὐὗὙὙὛὛὝὝὟώᾀᾴᾶᾼιιῂῄῆῌῐΐῖΊῠῬῲῴῶῼΩΩKÅ℮℮ↀↂ〇〇〡〩ぁゔァヺㄅㄬ一龥가힣", (byte) 1);
      LexUtils.SetChars("-.0:AZ__az··ÀÖØöøıĴľŁňŊžƀǃǍǰǴǵǺȗɐʨʻˁːˑ̀͠͡ͅΆΊΌΌΎΡΣώϐϖϚϚϜϜϞϞϠϠϢϳЁЌЎяёќўҁ҃҆ҐӄӇӈӋӌӐӫӮӵӸӹԱՖՙՙաֆֹֻֽֿֿׁׂ֑֣֡ׄׄאתװײءغـْ٠٩ٰڷںھۀێېۓە۪ۭۨ۰۹ँःअह़्॑॔क़ॣ०९ঁঃঅঌএঐওনপরললশহ়়াৄেৈো্ৗৗড়ঢ়য়ৣ০ৱਂਂਅਊਏਐਓਨਪਰਲਲ਼ਵਸ਼ਸਹ਼਼ਾੂੇੈੋ੍ਖ਼ੜਫ਼ਫ਼੦ੴઁઃઅઋઍઍએઑઓનપરલળવહ઼ૅેૉો્ૠૠ૦૯ଁଃଅଌଏଐଓନପରଲଳଶହ଼ୃେୈୋ୍ୖୗଡ଼ଢ଼ୟୡ୦୯ஂஃஅஊஎஐஒகஙசஜஜஞடணதநபமவஷஹாூெைொ்ௗௗ௧௯ఁఃఅఌఎఐఒనపళవహాౄెైొ్ౕౖౠౡ౦౯ಂಃಅಌಎಐಒನಪಳವಹಾೄೆೈೊ್ೕೖೞೞೠೡ೦೯ംഃഅഌഎഐഒനപഹാൃെൈൊ്ൗൗൠൡ൦൯กฮะฺเ๎๐๙ກຂຄຄງຈຊຊຍຍດທນຟມຣລລວວສຫອຮະູົຽເໄໆໆ່ໍ໐໙༘༙༠༩༹༹༵༵༷༷༾ཇཉཀྵ྄ཱ྆ྋྐྕྗྗྙྭྱྷྐྵྐྵႠჅაჶᄀᄀᄂᄃᄅᄇᄉᄉᄋᄌᄎᄒᄼᄼᄾᄾᅀᅀᅌᅌᅎᅎᅐᅐᅔᅕᅙᅙᅟᅡᅣᅣᅥᅥᅧᅧᅩᅩᅭᅮᅲᅳᅵᅵᆞᆞᆨᆨᆫᆫᆮᆯᆷᆸᆺᆺᆼᇂᇫᇫᇰᇰᇹᇹḀẛẠỹἀἕἘἝἠὅὈὍὐὗὙὙὛὛὝὝὟώᾀᾴᾶᾼιιῂῄῆῌῐΐῖΊῠῬῲῴῶῼ⃐⃜⃡⃡ΩΩKÅ℮℮ↀↂ々々〇〇〡〯〱〵ぁゔ゙゚ゝゞァヺーヾㄅㄬ一龥가힣", (byte) 2);
    }

    private static void SetChars(string ranges, byte value)
    {
      for (int index = 0; index < ranges.Length; index += 2)
      {
        int range1 = (int) ranges[index];
        for (int range2 = (int) ranges[index + 1]; range1 <= range2; ++range1)
          LexUtils._chars[range1] |= value;
      }
    }

    public static bool IsStartNameChar(char ch) => ((int) LexUtils._chars[(int) ch] & 1) != 0;

    public static bool IsStartNCNameChar(char ch) => LexUtils.IsStartNameChar(ch) && ch != ':';

    public static bool IsNameChar(char ch) => ((int) LexUtils._chars[(int) ch] & 2) != 0;

    public static bool IsNCNameChar(char ch) => LexUtils.IsNameChar(ch) && ch != ':';
  }
}
